Enums/СостоянияТелефонныхЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СостоянияТелефонныхЗвонков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вызов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУдержании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переадресация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоПереадресация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПопыткаПереадресации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переадресован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/УправлениеТелефониейОбработкаСобытий/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

 Процедура ОбработкаСобытийТелефонии(Источник, Событие, Данные) Экспорт 
	
	УправлениеТелефониейКлиент.ВывестиСообщениеЛога(Строка(Формат(ТекущаяДата(),"ДЛФ=T")) + " " + Событие + " => " + Данные);
	
	Если Событие = "ТелефонныйЗвонок" Тогда 				
		Если глТелефония.ПараметрыЗвонка.Направление Тогда
			//УправлениеТелефониейКлиентПовтИсп.ОткрытьКарточкуЗвонка();
			УправлениеТелефониейКлиент.ОткрытьКарточкуЗвонка();
		Иначе
			УправлениеТелефониейКлиентПовтИсп.ОткрытьРабочуюПанельТелефонии();
		КонецЕсли;
	ИначеЕсли Событие = "ТелефоннаяТрубкаСнята" Тогда
		
		Если Не ЗначениеЗаполнено(Данные) И НЕ глТекущиеЗвонки.Количество() Тогда
			УправлениеТелефониейКлиентПовтИсп.ОткрытьРабочуюПанельТелефонии();
			Оповестить("ТелефоннаяТрубкаСнята", , "Телефония");
			глТелефония["ТелефоннаяТрубкаОпущена"] = Ложь;
		КонецЕсли;	
			
	ИначеЕсли Событие = "ИдентификаторЗвонка" Тогда
		
		//UCID = Данные;
		
	ИначеЕсли Событие = "ТелефоннаяТрубкаОпущена" Тогда		
		
		Если Не ЗначениеЗаполнено(Данные) И НЕ глТекущиеЗвонки.Количество() Тогда
			Оповестить("ТелефоннаяТрубкаОпущена", , "Телефония");
			глТелефония["ТелефоннаяТрубкаОпущена"] = Истина;
		КонецЕсли;	
		
	ИначеЕсли Событие = "Log" Тогда 
		
		АнализЛогаСобытий(Данные);	
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура АнализЛогаСобытий(Данные)
		
	Если Найти(Данные, "ServiceProviderWrapper. SessionId=") Тогда //СтартСессии
		
		глТелефония["ИдентификаторСессииТелефонии"] = Сред(Данные, Найти(Данные, "ServiceProviderWrapper. SessionId=") + СтрДлина("ServiceProviderWrapper. SessionId=")); 
		
	ИначеЕсли Найти(Данные, "OnDisplayUpdatedEventHandler") Тогда //ОбновлениеОтображенияЗвонка 
		
		глТелефония["ПоследнийОбновленныйНомерТелефона"] = УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "ContentsOfDisplay="));

	ИначеЕсли  Найти(Данные, "ServiceProviderWrapper. deviceId=") Тогда //РегистрацияТекущегоНомера
		
		ОбработкаСобытия_РегистрацияТекущегоНомера(Данные);	
				
	ИначеЕсли Найти(Данные, "OnDeliveredEventHandler") Тогда //ВходящийЗвонок 
		
		ОбработкаСобытия_ВходящийЗвонок(Данные);
		
	ИначеЕсли Найти(Данные, "OriginatedEventHandler") Тогда //ИсходящийЗвонок 
		
		ОбработкаСобытия_ИсходящийЗвонок(Данные);
		
	ИначеЕсли Найти(Данные, "OnEstablishedEventHandler") Тогда //НачалоРазговора
		
		ОбработкаСобытия_НачалоРазговора(Данные);
			
	ИначеЕсли Найти(Данные, "OnHeldEventHandler") Тогда	//УстановкаЗвонкаНаУдержание

		ОбработкаСобытия_УстановкаЗвонкаНаУдержание(Данные);
		
	ИначеЕсли Найти(Данные, "OnRetrievedEventHandler") Тогда //ВозвратЗвонкаИзУдержания

		ОбработкаСобытия_ВозвратЗвонкаИзУдержания(Данные);
		
	ИначеЕсли Найти(Данные, "OnTransferredEventHandler") Тогда //ПереводЗвонка	
		
		ОбработкаСобытия_ПереводЗвонка(Данные);
		
	ИначеЕсли Найти(Данные, "OnFailedEventHandler") Тогда //НеудавшийсяЗвонок 
		
		ОбработкаСобытия_НеудавшийсяЗвонок(Данные);
		
	ИначеЕсли Найти(Данные, "OnConnectionClearedEventHandler") И НЕ Найти(глТелефония["ДанныеПредыдущегоСобытия"], "OnConnectionClearedEventHandler") И НЕ Найти(глТелефония["ДанныеПредыдущегоСобытия"], "OnFailedEventHandler") Тогда //ОкончаниеЗвонка 
		
		ОбработкаСобытия_ОкончаниеЗвонка(Данные);
		
	ИначеЕсли Найти(Данные, "OnDivertedEventHandler") Тогда //АвтоматическаяПереадресация
		
		ОбработкаСобытия_АвтоматическаяПереадресация(Данные);
		
	ИначеЕсли Найти(Данные, "OnConferencedEventHandler") И Найти(глТелефония["ДанныеПредыдущегоСобытия"], "OnDisplayUpdatedEventHandler") Тогда //НачалоКонференции
		
		ОбработкаСобытия_НачалоКонференции(Данные);
		
	КонецЕсли;
	
	глТелефония["ДанныеПредыдущегоСобытия"] = Данные;
	
КонецПроцедуры

Процедура ОбработкаСобытия_РегистрацияТекущегоНомера(Данные)
	
	НомерТелефона = УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "deviceId=");
	Если ЗначениеЗаполнено(НомерТелефона) Тогда
		глТелефония["deviceID"] = НомерТелефона;
		УправлениеТелефониейСервер.ОпределитьНомерТелефона(НомерТелефона);	
		Оповестить("ИзменениеСтатусаТелефонии", глТелефония["deviceID"], "Телефония");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаСобытия_ВходящийЗвонок(Данные)
	
	//НомерТелефона = УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(Данные);
	НомерТелефона = УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "CallingDeviceId="));	
	Если ЗначениеЗаполнено(НомерТелефона) И НЕ НомерТелефона = глТелефония["deviceID"] Тогда
		УправлениеТелефониейКлиент.ДобавитьЗвонокВСписокТекущих(НомерТелефона, "ВходящийЗвонок");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаСобытия_ИсходящийЗвонок(Данные) 
	
	НомерТелефона = УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "CalledDeviceId="));
	Если ЗначениеЗаполнено(НомерТелефона) И НЕ НомерТелефона = глТелефония["deviceID"] Тогда
		УправлениеТелефониейКлиентПовтИсп.ОткрытьРабочуюПанельТелефонии();
		УправлениеТелефониейКлиент.ДобавитьЗвонокВСписокТекущих(НомерТелефона, "ИсходящийЗвонок", Ложь); 
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаСобытия_НачалоРазговора(Данные) 
	
	ВызывающийНомер = УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "CallingDeviceId="));
	ВызываемыйНомер = УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "AnsweringDeviceId=")); 	
	Отвечающий = УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "AnsweringDeviceId=", Истина));
	Перенаправляющий = УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "LastRedirectedDeviceId=", Истина));
	Если ЗначениеЗаполнено(Перенаправляющий) И ЗначениеЗаполнено(Отвечающий) Тогда
		Для каждого Звонок Из глТекущиеЗвонки Цикл					
			Если Звонок.ПеренаправленС = Перенаправляющий 
				И Звонок.ПеренаправленНа = Отвечающий
				И Звонок.СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Переадресован") Тогда
				НомерТелефона = Звонок.НомерТелефона; 
			КонецЕсли;
		КонецЦикла;				
	Иначе	
		НомерТелефона = ?(ВызывающийНомер = глТелефония["deviceID"], ВызываемыйНомер, ВызывающийНомер);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерТелефона) Тогда
		ПараметрыЗвонка = УправлениеТелефониейКлиент.ПолучитьПараметрыЗвонка(НомерТелефона);
		Если НЕ ПараметрыЗвонка = Неопределено Тогда
			ПараметрыЗвонка.UCID = УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "GloballyUniqueCallLinkageId=");
			УправлениеТелефониейКлиент.ОбновитьПараметрыЗвонка(ПараметрыЗвонка, "НачалоРазговора", ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Разговор"));			
		КонецЕсли;	
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаСобытия_НеудавшийсяЗвонок(Данные) 
	
	ВызывающийНомер = УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "CallingDeviceId=", Истина));
	ВызываемыйНомер = УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "CalledDeviceId=", Истина)); 	
	НомерТелефона = ?(ВызывающийНомер = глТелефония["deviceID"], ВызываемыйНомер, ВызывающийНомер);
	
	ПараметрыЗвонка = УправлениеТелефониейКлиент.ПолучитьПараметрыЗвонка(НомерТелефона);
	Если НЕ ПараметрыЗвонка = Неопределено Тогда
		УправлениеТелефониейКлиент.ОбновитьПараметрыЗвонка(ПараметрыЗвонка, "ОкончаниеЗвонка", ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.НеПринят"), Истина);	
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаСобытия_ОкончаниеЗвонка(Данные) 
	
	Если глТекущиеЗвонки.ВГраница() < 0 Тогда
		Возврат;
	КонецЕсли;
	
	НомерТелефона = УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "ReleasingDeviceId=");
	Если ЗначениеЗаполнено(НомерТелефона) И НЕ НомерТелефона = глТелефония["deviceID"] Тогда 
		ПараметрыЗвонка = УправлениеТелефониейКлиент.ПолучитьПараметрыЗвонка(НомерТелефона);
	//ИначеЕсли НомерТелефона = глТелефония["deviceID"] И глТекущиеЗвонки.ВГраница() = 0 И глТекущиеЗвонки[0].СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Вызов") Тогда
	//	Возврат;
	ИначеЕсли ЗначениеЗаполнено(глТелефония["НомерТелефона"]) Тогда
		ПараметрыЗвонка = УправлениеТелефониейКлиент.ПолучитьПараметрыЗвонка(глТелефония["НомерТелефона"]);	
	ИначеЕсли НЕ ЗначениеЗаполнено(НомерТелефона) И глТекущиеЗвонки.ВГраница() > 0 И глТекущиеЗвонки[глТекущиеЗвонки.ВГраница()].СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.НаУдержании") Тогда
		ПараметрыЗвонка = УправлениеТелефониейКлиент.ПолучитьПараметрыЗвонка(глТекущиеЗвонки[глТекущиеЗвонки.ВГраница()].НомерТелефона);	
	ИначеЕсли НомерТелефона = глТелефония["deviceID"] И глТекущиеЗвонки.ВГраница() = 0 И глТекущиеЗвонки[0].СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Вызов") Тогда
		Возврат;		
	КонецЕсли;
	
	Если НЕ ПараметрыЗвонка = Неопределено Тогда 
		Если ПараметрыЗвонка.СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Вызов") ИЛИ НЕ ЗначениеЗаполнено(ПараметрыЗвонка.ДатаНачалаРазговора) Тогда 
			СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.НеПринят");
		Иначе
			СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Принят");
		КонецЕсли;
		Если ЗначениеЗаполнено(ПараметрыЗвонка.ID_Перенапраление)
			И ЗначениеЗаполнено(ПараметрыЗвонка.ДатаПеренаправленияЗвонка)			
			//И ЗначениеЗаполнено(ПараметрыЗвонка.ID_Группы)
			//И ЗначениеЗаполнено(ПараметрыЗвонка.UCID_Перенапраление)
			Тогда
			СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Переадресован");
		КонецЕсли;
		Если глТелефония.Состояние_ПопыткаПереадресации.ПопыткаПереадресации Тогда
			Если (СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.НеПринят") ИЛИ СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Принят"))
				И глТелефония.Состояние_ПопыткаПереадресации.ПеренаправленНа = ПараметрыЗвонка.НомерТелефона Тогда
				СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.ПопыткаПереадресации");
				ЗаполнитьЗначенияСвойств(ПараметрыЗвонка, глТелефония.Состояние_ПопыткаПереадресации);
				//ПараметрыЗвонка.ПерезаписатьID_Группы = Истина;
			КонецЕсли;
			УправлениеТелефониейКлиент.ОчиститьПараметрыПопыткиПереадресации();
		КонецЕсли;
		УправлениеТелефониейКлиент.ОбновитьПараметрыЗвонка(ПараметрыЗвонка, "ОкончаниеЗвонка", СостояниеЗвонка, Истина);
	ИначеЕсли (ЗначениеЗаполнено(НомерТелефона) И НомерТелефона = глТелефония["deviceID"]) ИЛИ (НЕ ЗначениеЗаполнено(НомерТелефона) И глТелефония["ТелефоннаяТрубкаОпущена"]) Тогда 
		Индекс = глТекущиеЗвонки.ВГраница();
		Пока Индекс >= 0 Цикл
			ПараметрыЗвонка = глТекущиеЗвонки[Индекс];		
			Если ПараметрыЗвонка.СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Вызов") ИЛИ НЕ ЗначениеЗаполнено(ПараметрыЗвонка.ДатаНачалаРазговора) Тогда 
				СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.НеПринят");
			Иначе
				СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Принят");
			КонецЕсли;
			Если ЗначениеЗаполнено(ПараметрыЗвонка.ID_Перенапраление)
				И ЗначениеЗаполнено(ПараметрыЗвонка.ДатаПеренаправленияЗвонка)
				//И ЗначениеЗаполнено(ПараметрыЗвонка.ID_Группы)
				//И ЗначениеЗаполнено(ПараметрыЗвонка.UCID_Перенапраление) 
				Тогда
				СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Переадресован");
			КонецЕсли;
			Если глТелефония.Состояние_ПопыткаПереадресации.ПопыткаПереадресации Тогда
				Если (СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.НеПринят") ИЛИ СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Принят")) 
					И глТелефония.Состояние_ПопыткаПереадресации.ПеренаправленНа = ПараметрыЗвонка.НомерТелефона Тогда
					СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.ПопыткаПереадресации");
					ЗаполнитьЗначенияСвойств(ПараметрыЗвонка, глТелефония.Состояние_ПопыткаПереадресации);
					//ПараметрыЗвонка.ПерезаписатьID_Группы = Истина;
				КонецЕсли;
				УправлениеТелефониейКлиент.ОчиститьПараметрыПопыткиПереадресации();
			КонецЕсли;		
			УправлениеТелефониейКлиент.ОбновитьПараметрыЗвонка(ПараметрыЗвонка, "ОкончаниеЗвонка", СостояниеЗвонка, Истина);	
			Индекс = Индекс - 1;
		КонецЦикла;
	КонецЕсли;                                                     
	
	Если НЕ глТекущиеЗвонки.Количество() Тогда
		глТелефония["ТелефоннаяТрубкаОпущена"] = Истина;
	КонецЕсли;	
		
КонецПроцедуры

Процедура ОбработкаСобытия_УстановкаЗвонкаНаУдержание(Данные) 
	
	НомерТелефона = УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "HoldingDeviceId="));
	Если ЗначениеЗаполнено(НомерТелефона) И НомерТелефона = глТелефония["deviceID"] Тогда
		Если глТекущиеЗвонки.Количество() > 1 Тогда 
			Для каждого Звонок Из глТекущиеЗвонки Цикл 
				Если Звонок.СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Разговор") Тогда
					ПараметрыЗвонка = УправлениеТелефониейКлиент.ПолучитьПараметрыЗвонка(Звонок.НомерТелефона);	
				КонецЕсли;	
			КонецЦикла;
		Иначе
			Если ЗначениеЗаполнено(глТелефония["НомерТелефона"]) Тогда
				ПараметрыЗвонка = УправлениеТелефониейКлиент.ПолучитьПараметрыЗвонка(глТелефония["НомерТелефона"]);
			Иначе
				Для каждого Звонок Из глТекущиеЗвонки Цикл 
					Если Звонок.СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Разговор") Тогда
						ПараметрыЗвонка = УправлениеТелефониейКлиент.ПолучитьПараметрыЗвонка(Звонок.НомерТелефона);	
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	Если НЕ ПараметрыЗвонка = Неопределено Тогда
		УправлениеТелефониейКлиент.ОбновитьПараметрыЗвонка(ПараметрыЗвонка, "УстановкаЗвонкаНаУдержание", ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.НаУдержании"));
	КонецЕсли;		
		
КонецПроцедуры

Процедура ОбработкаСобытия_ВозвратЗвонкаИзУдержания(Данные) 
	
	НомерТелефона = УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "RetrievingDeviceId="));
	Если ЗначениеЗаполнено(НомерТелефона) И НЕ НомерТелефона = глТелефония["deviceID"] Тогда 
		ПараметрыЗвонка =УправлениеТелефониейКлиент.ПолучитьПараметрыЗвонка(НомерТелефона);
	ИначеЕсли ЗначениеЗаполнено(глТелефония["ПоследнийОбновленныйНомерТелефона"]) Тогда
		ПараметрыЗвонка = УправлениеТелефониейКлиент.ПолучитьПараметрыЗвонка(глТелефония["ПоследнийОбновленныйНомерТелефона"]);
		Если ПараметрыЗвонка = Неопределено Тогда
			Если СтрДлина(глТелефония["ПоследнийОбновленныйНомерТелефона"]) = 4 И ЗначениеЗаполнено(глТелефония["НомерЛинии"]) Тогда
				ПараметрыЗвонка = УправлениеТелефониейКлиент.ПолучитьПараметрыЗвонка(глТелефония["ПоследнийОбновленныйНомерТелефона"], глТелефония["НомерЛинии"]);		
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли глТекущиеЗвонки.Количество() > 1 Тогда
		ПараметрыЗвонка = УправлениеТелефониейКлиент.ПолучитьПараметрыЗвонка(глТекущиеЗвонки[глТекущиеЗвонки.ВГраница() - 1].НомерТелефона);
	КонецЕсли;
	Если ПараметрыЗвонка = Неопределено Тогда
		Если глТекущиеЗвонки.Количество() = 1 И глТекущиеЗвонки[глТекущиеЗвонки.ВГраница()].СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.НаУдержании") Тогда
			ПараметрыЗвонка = глТекущиеЗвонки[глТекущиеЗвонки.ВГраница()];
		КонецЕсли;
	КонецЕсли;
	Если НЕ ПараметрыЗвонка = Неопределено Тогда
		УправлениеТелефониейКлиент.ОбновитьПараметрыЗвонка(ПараметрыЗвонка, "ВозвратЗвонкаИзУдержания", ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Разговор"));
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаСобытия_ПереводЗвонка(Данные) 
	
	УправлениеТелефониейКлиент.ОчиститьПараметрыПопыткиПереадресации();
	Если глТекущиеЗвонки.ВГраница() < 0 Тогда
		Возврат;
	КонецЕсли;	
	
	НомерПереводящего = УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "TransferringDeviceId="));
	НомерПринимающего = УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "TransferredDeviceId="));	
	
	Если ЗначениеЗаполнено(НомерПереводящего) И ЗначениеЗаполнено(НомерПринимающего) Тогда
		Если НомерПереводящего = глТелефония["deviceID"] Тогда
			Если НЕ ЗначениеЗаполнено(УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "TransferredDeviceId=", Истина))) И НЕ ЗначениеЗаполнено(глТелефония["ПоследнийОбновленныйНомерТелефона"]) Тогда	 //перевод на внешний номер			
				НомерПринимающего = глТекущиеЗвонки[глТекущиеЗвонки.ВГраница()].НомерТелефона;  
			КонецЕсли;			
			ПараметрыЗвонка = УправлениеТелефониейКлиент.ПолучитьПараметрыЗвонка(НомерПринимающего);	
			Если НЕ ПараметрыЗвонка = Неопределено Тогда 
				УправлениеТелефониейКлиент.ОбновитьПараметрыЗвонка(ПараметрыЗвонка, "ОкончаниеЗвонка", ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Переадресация"), Истина);
				Для каждого Звонок Из глТекущиеЗвонки Цикл
					Если Звонок.СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.НаУдержании") 
						И Звонок.ДатаНачалаЗвонка < ПараметрыЗвонка.ДатаНачалаЗвонка Тогда
						Звонок.ПеренаправленС = НомерПереводящего;
						Звонок.ПеренаправленНа = НомерПринимающего;
						Звонок.ID_Перенапраление = ПараметрыЗвонка.ID_Звонка;
						////??
						//Звонок.ID_Группы = ?(ЗначениеЗаполнено(ПараметрыЗвонка.ID_Группы), ПараметрыЗвонка.ID_Группы, ПараметрыЗвонка.ID_Звонка);//ПараметрыЗвонка.ID_Звонка;//ПараметрыЗвонка.ID_Группы;
						////??
						Звонок.UCID_Перенапраление = ПараметрыЗвонка.UCID;
						Если НЕ ЗначениеЗаполнено(Звонок.ДатаОкончанияЗвонка) Тогда
							Звонок.ДатаОкончанияЗвонка = ТекущаяДата();
						КонецЕсли;
						УправлениеТелефониейКлиент.ОбновитьПараметрыЗвонка(Звонок, "ПереводЗвонка", ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Переадресован"), Истина);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;			
		Иначе
			//2 вызова
			Звонок = УправлениеТелефониейКлиент.ПолучитьПараметрыЗвонка(НомерПереводящего);
			Если НЕ Звонок = Неопределено Тогда 
				УправлениеТелефониейКлиент.ОбновитьПараметрыЗвонка(Звонок, "ОкончаниеЗвонка", ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Переадресация"), Истина);
			КонецЕсли;			
			ПараметрыЗвонка = Неопределено;
			Если ЗначениеЗаполнено(глТелефония["ПоследнийОбновленныйНомерТелефона"]) Тогда
				Если НомерПринимающего = глТелефония["deviceID"] Тогда
					ПараметрыЗвонка = УправлениеТелефониейКлиент.ДобавитьЗвонокВСписокТекущих(глТелефония["ПоследнийОбновленныйНомерТелефона"], "ВходящийЗвонок");					
				Иначе
					ПараметрыЗвонка = УправлениеТелефониейКлиент.ДобавитьЗвонокВСписокТекущих(глТелефония["ПоследнийОбновленныйНомерТелефона"], "ИсходящийЗвонок");
				КонецЕсли;
			КонецЕсли;			
			Если НЕ ПараметрыЗвонка = Неопределено И НЕ Звонок = Неопределено Тогда 
				ПараметрыЗвонка.ПеренаправленС = НомерПереводящего;
				ПараметрыЗвонка.ПеренаправленНа = НомерПринимающего;				
				Если НЕ Звонок = Неопределено Тогда
					ПараметрыЗвонка.ДатаПеренаправленияЗвонка = ТекущаяДата();
					ПараметрыЗвонка.ID_Перенапраление = Звонок.ID_Звонка;
					////??
					//ПараметрыЗвонка.ID_Группы = Звонок.ID_Группы;//Звонок.ID_Звонка; !!!!!!!!!!!!
					////??					
					ПараметрыЗвонка.UCID_Перенапраление = Звонок.UCID;				
				КонецЕсли;
				УправлениеТелефониейКлиент.ОткрытьКарточкуЗвонка();
				УправлениеТелефониейКлиент.ОбновитьПараметрыЗвонка(ПараметрыЗвонка, "НачалоРазговора", ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Разговор"));							
			КонецЕсли;			
			//1 вызов
			//ПараметрыЗвонка = УправлениеТелефониейКлиент.ПолучитьПараметрыЗвонка(НомерПереводящего);
			//Если НЕ ПараметрыЗвонка = Неопределено Тогда
			//	ПараметрыЗвонка.ПеренаправленС = НомерПереводящего;
			//	ПараметрыЗвонка.ПеренаправленНа = НомерПринимающего;			
			//	ПараметрыЗвонка.ID_Перенапраления = ПараметрыЗвонка.ID_Звонка;
			//	ПараметрыЗвонка.UCID = ПараметрыЗвонка.UCID;
			//	Если ЗначениеЗаполнено(глТелефония["ПоследнийОбновленныйНомерТелефона"]) Тогда
			//		Если ПараметрыЗвонка.Направление Тогда
			//			ПараметрыЗвонка.ВызывающийНомер = глТелефония["ПоследнийОбновленныйНомерТелефона"];
			//		Иначе						
			//			ПараметрыЗвонка.ВызываемыйНомер = глТелефония["ПоследнийОбновленныйНомерТелефона"];
			//		КонецЕсли;
			//		ПараметрыЗвонка.НомерТелефона = глТелефония["ПоследнийОбновленныйНомерТелефона"];
			//		ПараметрыЗвонка.НовыйВызов = Истина;
			//	КонецЕсли;	
			//	УправлениеТелефониейКлиент.ОбновитьПараметрыЗвонка(ПараметрыЗвонка, "ПереводЗвонка", ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Переадресован"));
			//КонецЕсли;
			//УправлениеТелефониейКлиентПовтИсп.ОткрытьКарточкуЗвонка();
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаСобытия_АвтоматическаяПереадресация(Данные) 
	
	НомерТелефона = УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "DivertingDeviceId="));
	Приемник = УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(УправлениеТелефониейКлиент.ПолучитьНомерИзСообщенияЛога(Данные, "NewDestinationDeviceId="));
	Если ЗначениеЗаполнено(НомерТелефона) И НЕ НомерТелефона = глТелефония["deviceID"] Тогда 		
		ПараметрыЗвонка = УправлениеТелефониейКлиент.ПолучитьПараметрыЗвонка(НомерТелефона);
		Если НЕ ПараметрыЗвонка = Неопределено Тогда  
			ПараметрыЗвонка.ДатаПеренаправленияЗвонка = ТекущаяДата();
			ПараметрыЗвонка.ПеренаправленС = НомерТелефона;
			ПараметрыЗвонка.ПеренаправленНа = Приемник;	
			УправлениеТелефониейКлиент.ОбновитьПараметрыЗвонка(ПараметрыЗвонка, "ОкончаниеЗвонка", ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.АвтоПереадресация"), Истина);
		Иначе
			Индекс = глТекущиеЗвонки.ВГраница();
			Пока Индекс >= 0 Цикл
				ПараметрыЗвонка = глТекущиеЗвонки[Индекс];
				ПараметрыЗвонка.ДатаПеренаправленияЗвонка = ТекущаяДата();
				ПараметрыЗвонка.ПеренаправленС = НомерТелефона;
				ПараметрыЗвонка.ПеренаправленНа = Приемник;					
				Если ПараметрыЗвонка.СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Вызов") Тогда
					УправлениеТелефониейКлиент.ОбновитьПараметрыЗвонка(ПараметрыЗвонка, "ОкончаниеЗвонка", ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.АвтоПереадресация"), Истина);
				КонецЕсли;
				Индекс = Индекс - 1;
			КонецЦикла;
		КонецЕсли;
		Если ЗначениеЗаполнено(Приемник) Тогда
			УправлениеТелефониейКлиент.ДобавитьЗвонокВСписокТекущих(Приемник, "ИсходящийЗвонок", Ложь);	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаСобытия_НачалоКонференции(Данные) 
	
	Индекс = глТекущиеЗвонки.ВГраница();
	Пока Индекс >= 0 Цикл
		ПараметрыЗвонка = глТекущиеЗвонки[Индекс];
		Если ПараметрыЗвонка.СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Вызов") Тогда
			СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.НеПринят");
		Иначе
			СостояниеЗвонка = ПредопределенноеЗначение("Перечисление.СостоянияТелефонныхЗвонков.Принят");
		КонецЕсли;
		УправлениеТелефониейКлиент.ОбновитьПараметрыЗвонка(ПараметрыЗвонка, "ОкончаниеЗвонка", СостояниеЗвонка, Истина);
		Индекс = Индекс - 1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
